AlmAck/svdtonuttx/demo/h/da1470_crg_top.h
/****************************************************************************
 * ./tmp/da1470_crg_top.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __DA1470_CRG_TOP_H
#define __DA1470_CRG_TOP_H

/* Register offsets *********************************************************/

#define DA1470_CRG_TOP_ANA_STATUS_OFFSET                   0x00EC /* Analog Signals Status Register */
#define DA1470_CRG_TOP_BANDGAP_OFFSET                      0x0050 /* bandgap trimming */
#define DA1470_CRG_TOP_BIAS_VREF_SEL_OFFSET                0x00E8 /* No description available. */
#define DA1470_CRG_TOP_BOD_CTRL_OFFSET                     0x0060 /* Brown Out Detection control register */
#define DA1470_CRG_TOP_BOD_STATUS_OFFSET                   0x0064 /* No description available. */
#define DA1470_CRG_TOP_CLK_AMBA_OFFSET                     0x0000 /* HCLK, PCLK, divider and clock gates */
#define DA1470_CRG_TOP_CLK_CMAC_SWITCH_OFFSET              0x0004 /* Clock switching register for CMAC clock domain */
#define DA1470_CRG_TOP_CLK_CTRL_OFFSET                     0x0014 /* Clock control register */
#define DA1470_CRG_TOP_CLK_RADIO_OFFSET                    0x0010 /* Radio PLL control register */
#define DA1470_CRG_TOP_CLK_RCHS_OFFSET                     0x0044 /* Fast RC control register */
#define DA1470_CRG_TOP_CLK_RCLP_OFFSET                     0x003C /* 32/512 kHz RC oscillator register */
#define DA1470_CRG_TOP_CLK_RCX_OFFSET                      0x0048 /* RCX-oscillator control register */
#define DA1470_CRG_TOP_CLK_RTCDIV_OFFSET                   0x004C /* Divisor for RTC 100Hz clock */
#define DA1470_CRG_TOP_CLK_SNC_CTRL_OFFSET                 0x002C /* No description available. */
#define DA1470_CRG_TOP_CLK_SWITCH2XTAL_OFFSET              0x001C /* Switches clock from RC32M to XTAL32M */
#define DA1470_CRG_TOP_CLK_TMR_OFFSET                      0x0018 /* Clock control for the timers */
#define DA1470_CRG_TOP_CLK_XTAL32K_OFFSET                  0x0040 /* 32 kHz XTAL oscillator register */
#define DA1470_CRG_TOP_DISCHARGE_RAIL_OFFSET               0x00D4 /* Immediate rail resetting. There is no LDO/DCDC gating */
#define DA1470_CRG_TOP_LCD_EXT_CTRL_OFFSET                 0x0034 /* No description available. */
#define DA1470_CRG_TOP_P0_PAD_LATCH_OFFSET                 0x0070 /* Control the state retention of the GPIO ports */
#define DA1470_CRG_TOP_P0_RESET_PAD_LATCH_OFFSET           0x0078 /* Control the state retention of the GPIO ports */
#define DA1470_CRG_TOP_P0_SET_PAD_LATCH_OFFSET             0x0074 /* Control the state retention of the GPIO ports */
#define DA1470_CRG_TOP_P1_PAD_LATCH_OFFSET                 0x007C /* Control the state retention of the GPIO ports */
#define DA1470_CRG_TOP_P1_RESET_PAD_LATCH_OFFSET           0x0084 /* Control the state retention of the GPIO ports */
#define DA1470_CRG_TOP_P1_SET_PAD_LATCH_OFFSET             0x0080 /* Control the state retention of the GPIO ports */
#define DA1470_CRG_TOP_P2_PAD_LATCH_OFFSET                 0x0088 /* Control the state retention of the GPIO ports */
#define DA1470_CRG_TOP_P2_RESET_PAD_LATCH_OFFSET           0x0090 /* Control the state retention of the GPIO ports */
#define DA1470_CRG_TOP_P2_SET_PAD_LATCH_OFFSET             0x008C /* Control the state retention of the GPIO ports */
#define DA1470_CRG_TOP_PMU_CTRL_OFFSET                     0x0020 /* Power Management Unit control register */
#define DA1470_CRG_TOP_PMU_SLEEP_OFFSET                    0x00F4 /* Configures the sleep/wakeup strategy */
#define DA1470_CRG_TOP_PMU_TRIM_OFFSET                     0x00D0 /* No description available. */
#define DA1470_CRG_TOP_POR_CTRL_OFFSET                     0x0094 /* Controls the POR on VBAT */
#define DA1470_CRG_TOP_POR_PIN_OFFSET                      0x0098 /* Selects a GPIO pin for POR generation */
#define DA1470_CRG_TOP_POR_TIMER_OFFSET                    0x009C /* Time for POR to happen */
#define DA1470_CRG_TOP_POWER_CTRL_OFFSET                   0x00F0 /* Power control register */
#define DA1470_CRG_TOP_POWER_LVL_OFFSET                    0x00F8 /* No description available. */
#define DA1470_CRG_TOP_RAM_PWR_CTRL_OFFSET                 0x00C0 /* Control power state of System RAMS */
#define DA1470_CRG_TOP_RESET_STAT_OFFSET                   0x00BC /* Reset status register */
#define DA1470_CRG_TOP_RST_CTRL_OFFSET                     0x000C /* Reset control register */
#define DA1470_CRG_TOP_SECURE_BOOT_OFFSET                  0x00CC /* Controls secure booting */
#define DA1470_CRG_TOP_SLP_MAP_OFFSET                      0x0030 /* Map signals on GPIOs during sleep */
#define DA1470_CRG_TOP_SW_V18F_OFFSET                      0x00E4 /* No description available. */
#define DA1470_CRG_TOP_SYS_CTRL_OFFSET                     0x0024 /* System Control register */
#define DA1470_CRG_TOP_SYS_STAT_OFFSET                     0x0028 /* System status register */
#define DA1470_CRG_TOP_VBUS_IRQ_CLEAR_OFFSET               0x0058 /* Clear pending IRQ register */
#define DA1470_CRG_TOP_VBUS_IRQ_MASK_OFFSET                0x0054 /* IRQ masking */
#define DA1470_CRG_TOP_WAKEUP_HIBERN_OFFSET                0x00E0 /* No description available. */

