AlmAck/svdtonuttx/demo/h/da1470_crg_top.h
/* Register addresses *******************************************************/

#define DA1470_CRG_TOP_BASE                                0x50000000 /* CRG_TOP registers */

#define DA1470_CRG_TOP_ANA_STATUS                          (DA1470_CRG_TOP_BASE + DA1470_CRG_TOP_ANA_STATUS_OFFSET) /* Analog Signals Status Register */
#define DA1470_CRG_TOP_BANDGAP                             (DA1470_CRG_TOP_BASE + DA1470_CRG_TOP_BANDGAP_OFFSET) /* bandgap trimming */
#define DA1470_CRG_TOP_BIAS_VREF_SEL                       (DA1470_CRG_TOP_BASE + DA1470_CRG_TOP_BIAS_VREF_SEL_OFFSET) /* No description available. */
#define DA1470_CRG_TOP_BOD_CTRL                            (DA1470_CRG_TOP_BASE + DA1470_CRG_TOP_BOD_CTRL_OFFSET) /* Brown Out Detection control register */
#define DA1470_CRG_TOP_BOD_STATUS                          (DA1470_CRG_TOP_BASE + DA1470_CRG_TOP_BOD_STATUS_OFFSET) /* No description available. */
#define DA1470_CRG_TOP_CLK_AMBA                            (DA1470_CRG_TOP_BASE + DA1470_CRG_TOP_CLK_AMBA_OFFSET) /* HCLK, PCLK, divider and clock gates */
#define DA1470_CRG_TOP_CLK_CMAC_SWITCH                     (DA1470_CRG_TOP_BASE + DA1470_CRG_TOP_CLK_CMAC_SWITCH_OFFSET) /* Clock switching register for CMAC clock domain */
#define DA1470_CRG_TOP_CLK_CTRL                            (DA1470_CRG_TOP_BASE + DA1470_CRG_TOP_CLK_CTRL_OFFSET) /* Clock control register */
#define DA1470_CRG_TOP_CLK_RADIO                           (DA1470_CRG_TOP_BASE + DA1470_CRG_TOP_CLK_RADIO_OFFSET) /* Radio PLL control register */
#define DA1470_CRG_TOP_CLK_RCHS                            (DA1470_CRG_TOP_BASE + DA1470_CRG_TOP_CLK_RCHS_OFFSET) /* Fast RC control register */
#define DA1470_CRG_TOP_CLK_RCLP                            (DA1470_CRG_TOP_BASE + DA1470_CRG_TOP_CLK_RCLP_OFFSET) /* 32/512 kHz RC oscillator register */
#define DA1470_CRG_TOP_CLK_RCX                             (DA1470_CRG_TOP_BASE + DA1470_CRG_TOP_CLK_RCX_OFFSET) /* RCX-oscillator control register */
#define DA1470_CRG_TOP_CLK_RTCDIV                          (DA1470_CRG_TOP_BASE + DA1470_CRG_TOP_CLK_RTCDIV_OFFSET) /* Divisor for RTC 100Hz clock */
#define DA1470_CRG_TOP_CLK_SNC_CTRL                        (DA1470_CRG_TOP_BASE + DA1470_CRG_TOP_CLK_SNC_CTRL_OFFSET) /* No description available. */
#define DA1470_CRG_TOP_CLK_SWITCH2XTAL                     (DA1470_CRG_TOP_BASE + DA1470_CRG_TOP_CLK_SWITCH2XTAL_OFFSET) /* Switches clock from RC32M to XTAL32M */
#define DA1470_CRG_TOP_CLK_TMR                             (DA1470_CRG_TOP_BASE + DA1470_CRG_TOP_CLK_TMR_OFFSET) /* Clock control for the timers */
#define DA1470_CRG_TOP_CLK_XTAL32K                         (DA1470_CRG_TOP_BASE + DA1470_CRG_TOP_CLK_XTAL32K_OFFSET) /* 32 kHz XTAL oscillator register */
#define DA1470_CRG_TOP_DISCHARGE_RAIL                      (DA1470_CRG_TOP_BASE + DA1470_CRG_TOP_DISCHARGE_RAIL_OFFSET) /* Immediate rail resetting. There is no LDO/DCDC gating */
#define DA1470_CRG_TOP_LCD_EXT_CTRL                        (DA1470_CRG_TOP_BASE + DA1470_CRG_TOP_LCD_EXT_CTRL_OFFSET) /* No description available. */
#define DA1470_CRG_TOP_P0_PAD_LATCH                        (DA1470_CRG_TOP_BASE + DA1470_CRG_TOP_P0_PAD_LATCH_OFFSET) /* Control the state retention of the GPIO ports */
#define DA1470_CRG_TOP_P0_RESET_PAD_LATCH                  (DA1470_CRG_TOP_BASE + DA1470_CRG_TOP_P0_RESET_PAD_LATCH_OFFSET) /* Control the state retention of the GPIO ports */
#define DA1470_CRG_TOP_P0_SET_PAD_LATCH                    (DA1470_CRG_TOP_BASE + DA1470_CRG_TOP_P0_SET_PAD_LATCH_OFFSET) /* Control the state retention of the GPIO ports */
#define DA1470_CRG_TOP_P1_PAD_LATCH                        (DA1470_CRG_TOP_BASE + DA1470_CRG_TOP_P1_PAD_LATCH_OFFSET) /* Control the state retention of the GPIO ports */
#define DA1470_CRG_TOP_P1_RESET_PAD_LATCH                  (DA1470_CRG_TOP_BASE + DA1470_CRG_TOP_P1_RESET_PAD_LATCH_OFFSET) /* Control the state retention of the GPIO ports */
#define DA1470_CRG_TOP_P1_SET_PAD_LATCH                    (DA1470_CRG_TOP_BASE + DA1470_CRG_TOP_P1_SET_PAD_LATCH_OFFSET) /* Control the state retention of the GPIO ports */
#define DA1470_CRG_TOP_P2_PAD_LATCH                        (DA1470_CRG_TOP_BASE + DA1470_CRG_TOP_P2_PAD_LATCH_OFFSET) /* Control the state retention of the GPIO ports */
#define DA1470_CRG_TOP_P2_RESET_PAD_LATCH                  (DA1470_CRG_TOP_BASE + DA1470_CRG_TOP_P2_RESET_PAD_LATCH_OFFSET) /* Control the state retention of the GPIO ports */
#define DA1470_CRG_TOP_P2_SET_PAD_LATCH                    (DA1470_CRG_TOP_BASE + DA1470_CRG_TOP_P2_SET_PAD_LATCH_OFFSET) /* Control the state retention of the GPIO ports */
#define DA1470_CRG_TOP_PMU_CTRL                            (DA1470_CRG_TOP_BASE + DA1470_CRG_TOP_PMU_CTRL_OFFSET) /* Power Management Unit control register */
#define DA1470_CRG_TOP_PMU_SLEEP                           (DA1470_CRG_TOP_BASE + DA1470_CRG_TOP_PMU_SLEEP_OFFSET) /* Configures the sleep/wakeup strategy */
#define DA1470_CRG_TOP_PMU_TRIM                            (DA1470_CRG_TOP_BASE + DA1470_CRG_TOP_PMU_TRIM_OFFSET) /* No description available. */
#define DA1470_CRG_TOP_POR_CTRL                            (DA1470_CRG_TOP_BASE + DA1470_CRG_TOP_POR_CTRL_OFFSET) /* Controls the POR on VBAT */
#define DA1470_CRG_TOP_POR_PIN                             (DA1470_CRG_TOP_BASE + DA1470_CRG_TOP_POR_PIN_OFFSET) /* Selects a GPIO pin for POR generation */
#define DA1470_CRG_TOP_POR_TIMER                           (DA1470_CRG_TOP_BASE + DA1470_CRG_TOP_POR_TIMER_OFFSET) /* Time for POR to happen */
#define DA1470_CRG_TOP_POWER_CTRL                          (DA1470_CRG_TOP_BASE + DA1470_CRG_TOP_POWER_CTRL_OFFSET) /* Power control register */
#define DA1470_CRG_TOP_POWER_LVL                           (DA1470_CRG_TOP_BASE + DA1470_CRG_TOP_POWER_LVL_OFFSET) /* No description available. */
#define DA1470_CRG_TOP_RAM_PWR_CTRL                        (DA1470_CRG_TOP_BASE + DA1470_CRG_TOP_RAM_PWR_CTRL_OFFSET) /* Control power state of System RAMS */
#define DA1470_CRG_TOP_RESET_STAT                          (DA1470_CRG_TOP_BASE + DA1470_CRG_TOP_RESET_STAT_OFFSET) /* Reset status register */
#define DA1470_CRG_TOP_RST_CTRL                            (DA1470_CRG_TOP_BASE + DA1470_CRG_TOP_RST_CTRL_OFFSET) /* Reset control register */
#define DA1470_CRG_TOP_SECURE_BOOT                         (DA1470_CRG_TOP_BASE + DA1470_CRG_TOP_SECURE_BOOT_OFFSET) /* Controls secure booting */
#define DA1470_CRG_TOP_SLP_MAP                             (DA1470_CRG_TOP_BASE + DA1470_CRG_TOP_SLP_MAP_OFFSET) /* Map signals on GPIOs during sleep */
#define DA1470_CRG_TOP_SW_V18F                             (DA1470_CRG_TOP_BASE + DA1470_CRG_TOP_SW_V18F_OFFSET) /* No description available. */
#define DA1470_CRG_TOP_SYS_CTRL                            (DA1470_CRG_TOP_BASE + DA1470_CRG_TOP_SYS_CTRL_OFFSET) /* System Control register */
#define DA1470_CRG_TOP_SYS_STAT                            (DA1470_CRG_TOP_BASE + DA1470_CRG_TOP_SYS_STAT_OFFSET) /* System status register */
#define DA1470_CRG_TOP_VBUS_IRQ_CLEAR                      (DA1470_CRG_TOP_BASE + DA1470_CRG_TOP_VBUS_IRQ_CLEAR_OFFSET) /* Clear pending IRQ register */
#define DA1470_CRG_TOP_VBUS_IRQ_MASK                       (DA1470_CRG_TOP_BASE + DA1470_CRG_TOP_VBUS_IRQ_MASK_OFFSET) /* IRQ masking */
#define DA1470_CRG_TOP_WAKEUP_HIBERN                       (DA1470_CRG_TOP_BASE + DA1470_CRG_TOP_WAKEUP_HIBERN_OFFSET) /* No description available. */

/* Register bit definitions *************************************************/

