AlmAck/svdtonuttx/demo/h/da1470_crg_top.h
#define CRG_TOP_ANA_STATUS_FLAG_LDO_V30_COMBINED_OK        (1U << 29) /* No description available. */
#define CRG_TOP_ANA_STATUS_XOR_DOUT_WAKEUP_PADS            (1U << 28) /* Will be the result of XOR operation of the hibernation wakeup pads outputs combi */
#define CRG_TOP_ANA_STATUS_VBUS_AVAILABLE                  (1U << 27) /* High when VBUS > ( VBAT + 150 mV). Hysteresis is approx. 40 mV */
#define CRG_TOP_ANA_STATUS_FLAG_ADC_LDO_OK                 (1U << 26) /* When high, ldo_adc is active */
#define CRG_TOP_ANA_STATUS_FLAG_IBIAS_TRIM                 (1U << 25) /* 10nA Iref trimming, high when on-chip current is larger than reference current */
#define CRG_TOP_ANA_STATUS_BOD_VIN_NOK                     (1U << 24) /* General output of the BOD to indicate that one of the monitored inputs is below  */
#define CRG_TOP_ANA_STATUS_BG_OK                           (1U << 23) /* When high bandgap is active */
#define CRG_TOP_ANA_STATUS_BOOST_DCDC_VLED_OK              (1U << 22) /* When high, boost dcdc vled is active */
#define CRG_TOP_ANA_STATUS_LDO_VSYS_HIGH_TEMP              (1U << 21) /* If 1 indicates that temperature of LDO_VSYS is above operating conditions */
#define CRG_TOP_ANA_STATUS_VBAT_VSYS_STATE_MASK            (0x3 << 19) /* 0x0 : Hibernation mode or VBUS-only ( sysbat switch opened). 0x1 : Test mode ( s */
#define CRG_TOP_ANA_STATUS_VBAT_VSYS_STATE_POS             (19) /* 0x0 : Hibernation mode or VBUS-only ( sysbat switch opened). 0x1 : Test mode ( s */
#define CRG_TOP_ANA_STATUS_LDO_VSYS_HEAD_LIM               (1U << 18) /* When high, the headroom loop is controlling VSYS */
#define CRG_TOP_ANA_STATUS_LDO_VSYS_CURR_LIM               (1U << 17) /* When high, the current limiter is controlling VSYS */
#define CRG_TOP_ANA_STATUS_LDO_VSYS_LIM                    (1U << 16) /* When high, the voltage loop is controlling VSYS */
#define CRG_TOP_ANA_STATUS_LDO_VSYS_OK                     (1U << 15) /* When high, LDO_VSYS is in regulating mode */
#define CRG_TOP_ANA_STATUS_LDO_MIPI_OK                     (1U << 14) /* When high, ldo_mipi is active */
#define CRG_TOP_ANA_STATUS_LDO_V30_OK                      (1U << 13) /* When high, ldo_v30 is active */
#define CRG_TOP_ANA_STATUS_SWITCH_V18F_OK                  (1U << 12) /* V18F switch completely closed */
#define CRG_TOP_ANA_STATUS_BUCK_DCDC_V18P_OK               (1U << 11) /* V18P Rail ok based on DCDC V18P programmed level */
#define CRG_TOP_ANA_STATUS_BUCK_DCDC_V18_OK                (1U << 10) /* V18 Rail ok based on DCDC V18 programmed level */
#define CRG_TOP_ANA_STATUS_BUCK_DCDC_V14_OK                (1U << 9) /* V14 Rail ok based on DCDC V14 programmed level */
#define CRG_TOP_ANA_STATUS_BUCK_DCDC_V12_OK                (1U << 8) /* V12 Rail ok based on DCDC V12 programmed level */
#define CRG_TOP_ANA_STATUS_COMP_VBUS_PLUGIN                (1U << 7) /* VBUS is connected (VBUS > 2.5V) */
#define CRG_TOP_ANA_STATUS_COMP_VSYS_NEAR_VLED             (1U << 6) /* BOOST_VLED_SEL=0x0 : VSYS>4.3 BOOST_VLED_SEL=0x1 : VSYS>4.55 BOOST_VLED_SEL=0x2  */
#define CRG_TOP_ANA_STATUS_COMP_VBUS_ABOVE_VSYS            (1U << 5) /* VBUS>VSYS+0.05V */
#define CRG_TOP_ANA_STATUS_COMP_VSYS_OK                    (1U << 4) /* VSYS> 2.45V */
#define CRG_TOP_ANA_STATUS_COMP_VBAT_OK                    (1U << 3) /* VBAT> 2.7V */
#define CRG_TOP_ANA_STATUS_COMP_VBUS_OK                    (1U << 2) /* 1: VBUS> 4.1V 0: VBUS<3.4V */
#define CRG_TOP_ANA_STATUS_POR_VSYS_OK                     (1U << 1) /* No description available. */
#define CRG_TOP_ANA_STATUS_POR_V30_OK                      (1U << 0) /* No description available. */
#define CRG_TOP_BANDGAP_EN_BGR_TCCOMP                      (1U << 15) /* Enable Temperature compensation in the reference current for Charger and LED mod */
#define CRG_TOP_BANDGAP_BANDGAP_ENABLE_CLAMP               (1U << 12) /* Enables a supply clamp inside the bandgap that improves PSRR. Should be enabled  */
#define CRG_TOP_BANDGAP_BGR_TRIM_MASK                      (0x3F << 6) /* Trim register for bandgap */
#define CRG_TOP_BANDGAP_BGR_TRIM_POS                       (6) /* Trim register for bandgap */
#define CRG_TOP_BANDGAP_SYSRAM_LPMX                        (1U << 5) /* RAM Transparent Light Sleep (TLS) Core Enable for System RAMs and Cache RAM. Ass */
#define CRG_TOP_BANDGAP_BGR_ITRIM_MASK                     (0x1F << 0) /* Current trimming for bias */
#define CRG_TOP_BANDGAP_BGR_ITRIM_POS                      (0) /* Current trimming for bias */
#define CRG_TOP_BIAS_VREF_SEL_BIAS_VREF_RF2_SEL_MASK       (0xF << 4) /* same coding as BIAS_VREF_RF1_SEL. */
#define CRG_TOP_BIAS_VREF_SEL_BIAS_VREF_RF2_SEL_POS        (4) /* same coding as BIAS_VREF_RF1_SEL. */
#define CRG_TOP_BIAS_VREF_SEL_BIAS_VREF_RF1_SEL_MASK       (0xF << 0) /* Vref_code | Vref_Voltage (mV) 0:900 1:930 2:960 3:990 4:1020 5:1050 6:1080 7:111 */
#define CRG_TOP_BIAS_VREF_SEL_BIAS_VREF_RF1_SEL_POS        (0) /* Vref_code | Vref_Voltage (mV) 0:900 1:930 2:960 3:990 4:1020 5:1050 6:1080 7:111 */
#define CRG_TOP_BOD_CTRL_BOD_VBUS_RST_EN                   (1U << 18) /* If set, generate power-on reset on channel VBUS */
#define CRG_TOP_BOD_CTRL_BOD_VBAT_RST_EN                   (1U << 17) /* If set, generate power-on reset on channel VBAT. */
#define CRG_TOP_BOD_CTRL_BOD_MIPI_RST_EN                   (1U << 16) /* If set, generate power-on reset on channel VMIPI */
#define CRG_TOP_BOD_CTRL_BOD_VSYS_RST_EN                   (1U << 15) /* If set, generate power-on reset on channel VSYS. Bear in mind that there is an a */
#define CRG_TOP_BOD_CTRL_BOD_V18F_RST_EN                   (1U << 14) /* If set, generate power-on reset on channel V18F */
#define CRG_TOP_BOD_CTRL_BOD_V18P_RST_EN                   (1U << 13) /* If set, generate power-on reset on channel V18P */
#define CRG_TOP_BOD_CTRL_BOD_V18_RST_EN                    (1U << 12) /* If set, generate power-on reset on channel V18 */
#define CRG_TOP_BOD_CTRL_BOD_V14_RST_EN                    (1U << 11) /* If set, generate power-on reset on channel V14 */
#define CRG_TOP_BOD_CTRL_BOD_V12_RST_EN                    (1U << 10) /* If set, generate power-on reset on channel V12 */
#define CRG_TOP_BOD_CTRL_BOD_VBUS_EN                       (1U << 9) /* Enable brown-out detection for channel VBUS */
#define CRG_TOP_BOD_CTRL_BOD_VBAT_EN                       (1U << 8) /* Enable brown-out detection for channel VBAT. */
#define CRG_TOP_BOD_CTRL_BOD_MIPI_EN                       (1U << 7) /* Enable brown-out detection for channel VMIPI */
#define CRG_TOP_BOD_CTRL_BOD_VSYS_EN                       (1U << 6) /* Enable brown-out detection for channel VSYS. Bear in mind that there is an addit */
#define CRG_TOP_BOD_CTRL_BOD_V18F_EN                       (1U << 5) /* Enable brown-out detection for channel V18F */
#define CRG_TOP_BOD_CTRL_BOD_V18P_EN                       (1U << 4) /* Enable brown-out detection for channel V18P */
#define CRG_TOP_BOD_CTRL_BOD_V18_EN                        (1U << 3) /* Enable brown-out detection for channel V18 */
#define CRG_TOP_BOD_CTRL_BOD_V14_EN                        (1U << 2) /* Enable brown-out detection for channel V14 */
#define CRG_TOP_BOD_CTRL_BOD_V12_EN                        (1U << 1) /* Enable brown-out detection for channel VDD (V12) */
#define CRG_TOP_BOD_CTRL_BOD_STATUS_CLEAR                  (1U << 0) /* Clears BOD_STATUS_REG when this bit is 1 for more than 2us. It must be 0 to regi */
#define CRG_TOP_BOD_STATUS_BOD_VBUS                        (1U << 8) /* 1: below trigger level (BOD event) 0: above trigger level */
#define CRG_TOP_BOD_STATUS_BOD_VBAT                        (1U << 7) /* 1: below trigger level (BOD event) 0: above trigger level */
#define CRG_TOP_BOD_STATUS_BOD_VMIPI                       (1U << 6) /* 1: below trigger level (BOD event) 0: above trigger level */
#define CRG_TOP_BOD_STATUS_BOD_VSYS                        (1U << 5) /* 1: below trigger level (BOD event) 0: above trigger level */
#define CRG_TOP_BOD_STATUS_BOD_V18F                        (1U << 4) /* 1: below trigger level (BOD event) 0: above trigger level */
#define CRG_TOP_BOD_STATUS_BOD_V18P                        (1U << 3) /* 1: below trigger level (BOD event) 0: above trigger level */
#define CRG_TOP_BOD_STATUS_BOD_V18                         (1U << 2) /* 1: below trigger level (BOD event) 0: above trigger level */
#define CRG_TOP_BOD_STATUS_BOD_V14                         (1U << 1) /* 1: below trigger level (BOD event) 0: above trigger level */
#define CRG_TOP_BOD_STATUS_BOD_V12                         (1U << 0) /* 1: below trigger level (BOD event) 0: above trigger level */
#define CRG_TOP_CLK_AMBA_OQSPI_PULLUP_ENABLE               (1U << 20) /* Selects pull value when OQSPIF_D* pads are not output. 0: The pads are pull-down */
#define CRG_TOP_CLK_AMBA_OQSPI_GPIO_MODE                   (1U << 19) /* If this bit is set, the upper 4 pins of the OQSPIF controller can be used as GPI */
#define CRG_TOP_CLK_AMBA_QSPIC2_ENABLE                     (1U << 18) /* Clock enable for QSPI RAM controller */
#define CRG_TOP_CLK_AMBA_QSPIC2_DIV_MASK                   (0x3 << 16) /* Clock divider setting. 0b00: divide by 1 0b01: divide by 2 0b10: divide by 4 0b1 */
#define CRG_TOP_CLK_AMBA_QSPIC2_DIV_POS                    (16) /* Clock divider setting. 0b00: divide by 1 0b01: divide by 2 0b10: divide by 4 0b1 */
#define CRG_TOP_CLK_AMBA_QSPIC_ENABLE                      (1U << 15) /* Clock enable for QSPI FLASH2 controller */
#define CRG_TOP_CLK_AMBA_QSPIC_DIV_MASK                    (0x3 << 13) /* Clock divider setting. 0b00: divide by 1 0b01: divide by 2 0b10: divide by 4 0b1 */
#define CRG_TOP_CLK_AMBA_QSPIC_DIV_POS                     (13) /* Clock divider setting. 0b00: divide by 1 0b01: divide by 2 0b10: divide by 4 0b1 */
#define CRG_TOP_CLK_AMBA_OQSPIF_ENABLE                     (1U << 12) /* Clock enable for Octal SPI controller */
#define CRG_TOP_CLK_AMBA_OQSPIF_DIV_MASK                   (0x3 << 10) /* Clock divider setting. 0b00: divide by 1 0b01: divide by 2 0b10: divide by 4 0b1 */
#define CRG_TOP_CLK_AMBA_OQSPIF_DIV_POS                    (10) /* Clock divider setting. 0b00: divide by 1 0b01: divide by 2 0b10: divide by 4 0b1 */
#define CRG_TOP_CLK_AMBA_OTP_ENABLE                        (1U << 9) /* Clock enable for OTP controller */
#define CRG_TOP_CLK_AMBA_AES_CLK_ENABLE                    (1U << 8) /* Clock enable for AES crypto block */
#define CRG_TOP_CLK_AMBA_SLOW_PCLK_DIV_MASK                (0x7 << 5) /* Slow-APB interface clock, derived from DIVN_CLK: 0b000: divide divn_clk by 1 0b0 */
#define CRG_TOP_CLK_AMBA_SLOW_PCLK_DIV_POS                 (5) /* Slow-APB interface clock, derived from DIVN_CLK: 0b000: divide divn_clk by 1 0b0 */
#define CRG_TOP_CLK_AMBA_PCLK_DIV_MASK                     (0x3 << 3) /* Fast-APB interface clock, Cascaded with HCLK: 0b00: divide hclk by 1 0b01: divid */
#define CRG_TOP_CLK_AMBA_PCLK_DIV_POS                      (3) /* Fast-APB interface clock, Cascaded with HCLK: 0b00: divide hclk by 1 0b01: divid */
#define CRG_TOP_CLK_AMBA_HCLK_DIV_MASK                     (0x7 << 0) /* AHB interface and microprocessor clock. Source clock divided by: 0b000: divide c */
#define CRG_TOP_CLK_AMBA_HCLK_DIV_POS                      (0) /* AHB interface and microprocessor clock. Source clock divided by: 0b000: divide c */
#define CRG_TOP_CLK_CMAC_SWITCH_CMAC_RUNNING_ON_XTAL       (1U << 2) /* This bit is '1' when the CMAC_CLK is enabled, and the switch is set in the XTAL3 */
#define CRG_TOP_CLK_CMAC_SWITCH_CMAC_RUNNING_ON_DIVN       (1U << 1) /* This bit is '1' when the CMAC_CLK is enabled, and the switch is set in the DIVN_ */
#define CRG_TOP_CLK_CMAC_SWITCH_CMAC_CLK_SEL               (1U << 0) /* Selects the clock source of the CMAC_CLK. 0: DIVN_CLK is selected 1: XTAL32M is  */
#define CRG_TOP_CLK_CTRL_RUNNING_AT_PLL                    (1U << 15) /* Indicates that the PLL clock is used as clock, and may not be switched off */
#define CRG_TOP_CLK_CTRL_RUNNING_AT_XTAL32M                (1U << 14) /* Indicates that the XTAL32M clock is used as clock, and may not be switched off */
#define CRG_TOP_CLK_CTRL_RUNNING_AT_RCHS                   (1U << 13) /* Indicates that the RCHS clock is used as clock */
#define CRG_TOP_CLK_CTRL_RUNNING_AT_RCLP                   (1U << 12) /* Indicates that the RCLP_CLK is being used as clock */
#define CRG_TOP_CLK_CTRL_VAD_CLK_SEL                       (1U << 6) /* Selects the clock for the VAD. 0: Select RCLP clock (normalized for ~32KHz) 1: S */
#define CRG_TOP_CLK_CTRL_LP_CLK_SEL_MASK                   (0x3 << 2) /* Sets the clock source of the LowerPower clock 0x0: RC32K 0x1: RCX 0x2: XTAL32K t */
#define CRG_TOP_CLK_CTRL_LP_CLK_SEL_POS                    (2) /* Sets the clock source of the LowerPower clock 0x0: RC32K 0x1: RCX 0x2: XTAL32K t */
#define CRG_TOP_CLK_CTRL_SYS_CLK_SEL_MASK                  (0x3 << 0) /* Selects the clock source. 0x0 : XTAL32M 0x1 : RCHS 0x2 : The Low Power clock is  */
#define CRG_TOP_CLK_CTRL_SYS_CLK_SEL_POS                   (0) /* Selects the clock source. 0x0 : XTAL32M 0x1 : RCHS 0x2 : The Low Power clock is  */
#define CRG_TOP_CLK_RADIO_RAD_REG_RESET_REQ                (1U << 6) /* Reset request for registers of the radio PHY. */
#define CRG_TOP_CLK_RADIO_RFCU_ENABLE                      (1U << 5) /* Enable the RF control Unit clock */
#define CRG_TOP_CLK_RADIO_CMAC_SYNCH_RESET                 (1U << 4) /* Force synchronous reset to CMAC core and Sleep Timer. Its effective only when bo */
#define CRG_TOP_CLK_RADIO_CMAC_CLK_ENABLE                  (1U << 2) /* Enables the clock */
#define CRG_TOP_CLK_RCHS_RCHS_SPEED_MASK                   (0x3 << 22) /* Selects speed of RCHS output 0b00: 32MHz, by dividing 96 / 3. 0b01: 96MHz, by di */
#define CRG_TOP_CLK_RCHS_RCHS_SPEED_POS                    (22) /* Selects speed of RCHS output 0b00: 32MHz, by dividing 96 / 3. 0b01: 96MHz, by di */
#define CRG_TOP_CLK_RCHS_RCHS_INIT_RANGE_MASK              (0x3 << 20) /* Course frequency adjustment */
#define CRG_TOP_CLK_RCHS_RCHS_INIT_RANGE_POS               (20) /* Course frequency adjustment */
#define CRG_TOP_CLK_RCHS_RCHS_INIT_DEL_MASK                (0xFF << 12) /* Fine frequency adjustment */
#define CRG_TOP_CLK_RCHS_RCHS_INIT_DEL_POS                 (12) /* Fine frequency adjustment */
#define CRG_TOP_CLK_RCHS_RCHS_INIT_DTCF_MASK               (0x7 << 9) /* Fine duty-cycle adjustment. 0x0: minimum 0x2: default 0x4: maximum 0x5 until 0x7 */
#define CRG_TOP_CLK_RCHS_RCHS_INIT_DTCF_POS                (9) /* Fine duty-cycle adjustment. 0x0: minimum 0x2: default 0x4: maximum 0x5 until 0x7 */
#define CRG_TOP_CLK_RCHS_RCHS_INIT_DTC_MASK                (0xF << 5) /* Course duty-cycle adjustment. 0x0: minimum 0x5: default 0xA: maximum 0xB until 0 */
#define CRG_TOP_CLK_RCHS_RCHS_INIT_DTC_POS                 (5) /* Course duty-cycle adjustment. 0x0: minimum 0x5: default 0xA: maximum 0xB until 0 */
#define CRG_TOP_CLK_RCHS_RCHS_BIAS_MASK                    (0xF << 1) /* Bias adjustment */
#define CRG_TOP_CLK_RCHS_RCHS_BIAS_POS                     (1) /* Bias adjustment */
#define CRG_TOP_CLK_RCHS_RCHS_ENABLE                       (1U << 0) /* Enables the HighSpeed RC oscillator */
#define CRG_TOP_CLK_RCLP_RCLP_LOW_SPEED_FORCE              (1U << 5) /* Forces RCLP in 32kHz mode. If this bit is 0 then RCLP frequency is 512KHz */
#define CRG_TOP_CLK_RCLP_RCLP_TRIM_MASK                    (0xF << 1) /* 0000 = lowest frequency 0111 = default 1111 = highest frequency */
#define CRG_TOP_CLK_RCLP_RCLP_TRIM_POS                     (1) /* 0000 = lowest frequency 0111 = default 1111 = highest frequency */
#define CRG_TOP_CLK_RCLP_RCLP_ENABLE                       (1U << 0) /* Enables the 32kHz RC oscillator. This bit is gated to '0' automatically when sle */
#define CRG_TOP_CLK_RCX_RCX_BIAS_MASK                      (0xF << 8) /* LDO bias current. 0x0: minimum 0xF: maximum */
#define CRG_TOP_CLK_RCX_RCX_BIAS_POS                       (8) /* LDO bias current. 0x0: minimum 0xF: maximum */
#define CRG_TOP_CLK_RCX_RCX_C0                             (1U << 7) /* Add unit capacitance to RC-time delay. */
#define CRG_TOP_CLK_RCX_RCX_CADJUST_MASK                   (0x1F << 2) /* Adjust capacitance part of RC-time delay. 0x00: minimum capacitance 0x1F: maximu */
#define CRG_TOP_CLK_RCX_RCX_CADJUST_POS                    (2) /* Adjust capacitance part of RC-time delay. 0x00: minimum capacitance 0x1F: maximu */
#define CRG_TOP_CLK_RCX_RCX_ENABLE                         (1U << 0) /* 0: Disable the RCX oscillator (watchdog runs at RCLP) 1: Enable the RCX oscillat */
#define CRG_TOP_CLK_RTCDIV_RTC_RESET_REQ                   (1U << 21) /* Reset request for the RTC module */
#define CRG_TOP_CLK_RTCDIV_RTC_DIV_ENABLE                  (1U << 20) /* Enable for the 100 Hz generation for the RTC block */
#define CRG_TOP_CLK_RTCDIV_RTC_DIV_DENOM                   (1U << 19) /* Selects the denominator for the fractional division: 0b0: 1000 0b1: 1024 */
#define CRG_TOP_CLK_RTCDIV_RTC_DIV_INT_MASK                (0x1FF << 10) /* Integer divisor part for RTC 100Hz generation */
#define CRG_TOP_CLK_RTCDIV_RTC_DIV_INT_POS                 (10) /* Integer divisor part for RTC 100Hz generation */
#define CRG_TOP_CLK_RTCDIV_RTC_DIV_FRAC_MASK               (0x3FF << 0) /* Fractional divisor part for RTC 100Hz generation. if RTC_DIV_DENOM=1, <RTC_DIV_F */
#define CRG_TOP_CLK_RTCDIV_RTC_DIV_FRAC_POS                (0) /* Fractional divisor part for RTC 100Hz generation. if RTC_DIV_DENOM=1, <RTC_DIV_F */
#define CRG_TOP_CLK_SNC_CTRL_SNC_STATE_RETAINED            (1U << 2) /* A flag which can be used from FW to indicate that the CPU state has been retaine */
#define CRG_TOP_CLK_SNC_CTRL_SNC_CLK_ENABLE                (1U << 1) /* Clock-enable for the CM0plus in the SNC. */
#define CRG_TOP_CLK_SNC_CTRL_SNC_RESET_REQ                 (1U << 0) /* Force the SNC microprocessor in reset. */
#define CRG_TOP_CLK_SWITCH2XTAL_SWITCH2XTAL                (1U << 0) /* When writing to this register, the clock switch will happen from RC32M to XTAL32 */
#define CRG_TOP_CLK_TMR_TMR2_PWM_AON_MODE                  (1U << 2) /* Maps Timer2_pwm onto P1_17. This state is preserved during deep sleep, to allow  */
#define CRG_TOP_CLK_TMR_TMR_PWM_AON_MODE                   (1U << 1) /* Maps Timer1_pwm onto P1_00 This state is preserved during deep sleep, to allow P */
#define CRG_TOP_CLK_TMR_WAKEUPCT_ENABLE                    (1U << 0) /* Enables the clock */
#define CRG_TOP_CLK_XTAL32K_XTAL32K_DISABLE_OUTPUT         (1U << 9) /* Disables output buffer, test only */
#define CRG_TOP_CLK_XTAL32K_XTAL32K_DISABLE_AMPREG         (1U << 7) /* Setting this bit disables the amplitude regulation of the XTAL32kHz oscillator.  */
#define CRG_TOP_CLK_XTAL32K_XTAL32K_CUR_MASK               (0xF << 3) /* Bias current for the 32kHz XTAL oscillator. 0000 is minimum, 1111 is maximum, 00 */
#define CRG_TOP_CLK_XTAL32K_XTAL32K_CUR_POS                (3) /* Bias current for the 32kHz XTAL oscillator. 0000 is minimum, 1111 is maximum, 00 */
#define CRG_TOP_CLK_XTAL32K_XTAL32K_RBIAS_MASK             (0x3 << 1) /* Setting for the bias resistor. 00 is maximum, 11 is minimum. Prefered setting wi */
#define CRG_TOP_CLK_XTAL32K_XTAL32K_RBIAS_POS              (1) /* Setting for the bias resistor. 00 is maximum, 11 is minimum. Prefered setting wi */
#define CRG_TOP_CLK_XTAL32K_XTAL32K_ENABLE                 (1U << 0) /* Enables the 32kHz XTAL oscillator */
#define CRG_TOP_DISCHARGE_RAIL_RESET_V30                   (1U << 4) /* 1: Enables immediate discharging of the V30 rail. Note that the source is not di */
#define CRG_TOP_DISCHARGE_RAIL_RESET_VPOD                  (1U << 3) /* 1: Enables immediate discharging of the VPOD rail. Note that the source is not d */
#define CRG_TOP_DISCHARGE_RAIL_RESET_V18P                  (1U << 2) /* 1: Enables immediate discharging of the V18P rail. Note that the source is not d */
#define CRG_TOP_DISCHARGE_RAIL_RESET_V18                   (1U << 1) /* 1: Enables immediate discharging of the V18 rail. Note that the source is not di */
#define CRG_TOP_DISCHARGE_RAIL_RESET_V14                   (1U << 0) /* 1: Enables immediate discharging of the V14 rail. Note that the source is not di */
#define CRG_TOP_LCD_EXT_CTRL_LCD_EXT_CLK_EN                (1U << 10) /* No description available. */
#define CRG_TOP_LCD_EXT_CTRL_LCD_EXT_CNT_RELOAD_MASK       (0x3FF << 0) /* Reload value for LCD_EXT_CLK generation. When the counter hits 0x0, it is reload */
#define CRG_TOP_LCD_EXT_CTRL_LCD_EXT_CNT_RELOAD_POS        (0) /* Reload value for LCD_EXT_CLK generation. When the counter hits 0x0, it is reload */
#define CRG_TOP_P0_PAD_LATCH_P0_LATCH_EN_MASK              (0xFFFFFFFF << 0) /* Direct write to the individual pad latching signals. Latches the control signals */
#define CRG_TOP_P0_PAD_LATCH_P0_LATCH_EN_POS               (0) /* Direct write to the individual pad latching signals. Latches the control signals */
#define CRG_TOP_P0_RESET_PAD_LATCH_P0_RESET_LATCH_EN_MASK  (0xFFFFFFFF << 0) /* Direct Reset of the marked bits. Reading returns 0x0. */
#define CRG_TOP_P0_RESET_PAD_LATCH_P0_RESET_LATCH_EN_POS   (0) /* Direct Reset of the marked bits. Reading returns 0x0. */
#define CRG_TOP_P0_SET_PAD_LATCH_P0_SET_LATCH_EN_MASK      (0xFFFFFFFF << 0) /* Direct Set of the marked bits. Reading returns 0x0. */
#define CRG_TOP_P0_SET_PAD_LATCH_P0_SET_LATCH_EN_POS       (0) /* Direct Set of the marked bits. Reading returns 0x0. */
#define CRG_TOP_P1_PAD_LATCH_P1_LATCH_EN_MASK              (0xFFFFFFFF << 0) /* Direct write to the individual pad latching signals. Latches the control signals */
#define CRG_TOP_P1_PAD_LATCH_P1_LATCH_EN_POS               (0) /* Direct write to the individual pad latching signals. Latches the control signals */
#define CRG_TOP_P1_RESET_PAD_LATCH_P1_RESET_LATCH_EN_MASK  (0xFFFFFFFF << 0) /* Direct Reset of the marked bits. Reading returns 0x0. */
#define CRG_TOP_P1_RESET_PAD_LATCH_P1_RESET_LATCH_EN_POS   (0) /* Direct Reset of the marked bits. Reading returns 0x0. */
#define CRG_TOP_P1_SET_PAD_LATCH_P1_SET_LATCH_EN_MASK      (0xFFFFFFFF << 0) /* Direct Set of the marked bits. Reading returns 0x0. */
#define CRG_TOP_P1_SET_PAD_LATCH_P1_SET_LATCH_EN_POS       (0) /* Direct Set of the marked bits. Reading returns 0x0. */
#define CRG_TOP_P2_PAD_LATCH_P2_LATCH_EN_MASK              (0x7FFF << 0) /* Direct write to the individual pad latching signals. Latches the control signals */
#define CRG_TOP_P2_PAD_LATCH_P2_LATCH_EN_POS               (0) /* Direct write to the individual pad latching signals. Latches the control signals */
#define CRG_TOP_P2_RESET_PAD_LATCH_P2_RESET_LATCH_EN_MASK  (0x7FFF << 0) /* Direct Reset of the marked bits. Reading returns 0x0. */
#define CRG_TOP_P2_RESET_PAD_LATCH_P2_RESET_LATCH_EN_POS   (0) /* Direct Reset of the marked bits. Reading returns 0x0. */
#define CRG_TOP_P2_SET_PAD_LATCH_P2_SET_LATCH_EN_MASK      (0x7FFF << 0) /* Direct Set of the marked bits. Reading returns 0x0. */
#define CRG_TOP_P2_SET_PAD_LATCH_P2_SET_LATCH_EN_POS       (0) /* Direct Set of the marked bits. Reading returns 0x0. */
#define CRG_TOP_PMU_CTRL_RETAIN_RGP_RAM                    (1U << 13) /* Retain the R-G-B RAMs inside the LCD display controller */
#define CRG_TOP_PMU_CTRL_RETAIN_GPU_CLUT                   (1U << 12) /* Retain the GPU CLUT memory */
#define CRG_TOP_PMU_CTRL_RETAIN_DCACHE                     (1U << 11) /* Selects the retainability of the dcache block while PD_CTRL is off. '1' is retai */
#define CRG_TOP_PMU_CTRL_GPU_SLEEP                         (1U << 10) /* Put the GPU power domain (PD_GPU) in powerdown */
#define CRG_TOP_PMU_CTRL_CTRL_SLEEP                        (1U << 9) /* Put the Controller power domain (PD_CTRL) in powerdown */
#define CRG_TOP_PMU_CTRL_ENABLE_CLKLESS                    (1U << 8) /* Selects the clockless sleep mode. Wakeup is done asynchronously. When set to '1' */
