AlmAck/svdtonuttx/demo/h/da1470_crg_top.h
#define CRG_TOP_PMU_CTRL_RETAIN_CACHE                      (1U << 7) /* Selects the retainability of the cache block during deep sleep. '1' is retainabl */
#define CRG_TOP_PMU_CTRL_SYS_SLEEP                         (1U << 6) /* Put the System powerdomain (PD_SYS) in powerdown. If this bit is '1', and there  */
#define CRG_TOP_PMU_CTRL_RESET_ON_WAKEUP                   (1U << 5) /* Perform a Hardware Reset after waking up. Booter will be started. */
#define CRG_TOP_PMU_CTRL_SNC_SLEEP                         (1U << 3) /* Put the Communications powerdomain (PD_SNC) in powerdown */
#define CRG_TOP_PMU_CTRL_TIM_SLEEP                         (1U << 2) /* Put the Timers Powerdomain (PD_TIM) in powerdown. */
#define CRG_TOP_PMU_CTRL_RADIO_SLEEP                       (1U << 1) /* Put the digital part of the radio, including CMAC (PD_RAD) in powerdown */
#define CRG_TOP_PMU_CTRL_AUD_SLEEP                         (1U << 0) /* Put the audio power domain (PD_AUD) in powerdown */
#define CRG_TOP_PMU_SLEEP_ULTRA_FAST_WAKEUP                (1U << 31) /* Allows the core to start running on the RC32M while the PMU is still waiting for */
#define CRG_TOP_PMU_SLEEP_ENABLE_FAST_SWITCH               (1U << 30) /* Enables early clock switching upon event detection to speed up wakeup time */
#define CRG_TOP_PMU_SLEEP_VLED_BYPASS_REFRESH_TIME_MASK    (0x7F << 23) /* This setting determines how long the VLED bypass switch is closed when VSYS near */
#define CRG_TOP_PMU_SLEEP_VLED_BYPASS_REFRESH_TIME_POS     (23) /* This setting determines how long the VLED bypass switch is closed when VSYS near */
#define CRG_TOP_PMU_SLEEP_BOD_SLEEP_INTERVAL_MASK          (0xF << 19) /* "This is the interval at which the BOD comparators/POR will be checked during sl */
#define CRG_TOP_PMU_SLEEP_BOD_SLEEP_INTERVAL_POS           (19) /* "This is the interval at which the BOD comparators/POR will be checked during sl */
#define CRG_TOP_PMU_SLEEP_RAILS_REFRESH_INTERVAL_MASK      (0x3FFF << 5) /* This is the interval at which the power rails reference voltage will be refreshe */
#define CRG_TOP_PMU_SLEEP_RAILS_REFRESH_INTERVAL_POS       (5) /* This is the interval at which the power rails reference voltage will be refreshe */
#define CRG_TOP_PMU_SLEEP_BASE_REFRESH_INTERVAL_MASK       (0x1F << 0) /* This sets the base time for calculating the intervals at which PMU refreshes dur */
#define CRG_TOP_PMU_SLEEP_BASE_REFRESH_INTERVAL_POS        (0) /* This sets the base time for calculating the intervals at which PMU refreshes dur */
#define CRG_TOP_PMU_TRIM_IBIAS_10N_TRIM_MASK               (0x7 << 8) /* No description available. */
#define CRG_TOP_PMU_TRIM_IBIAS_10N_TRIM_POS                (8) /* No description available. */
#define CRG_TOP_PMU_TRIM_LDO_RET_V30_TRIM_MASK             (0xF << 4) /* No description available. */
#define CRG_TOP_PMU_TRIM_LDO_RET_V30_TRIM_POS              (4) /* No description available. */
#define CRG_TOP_PMU_TRIM_LDO_V30_TRIM_MASK                 (0xF << 0) /* No description available. */
#define CRG_TOP_PMU_TRIM_LDO_V30_TRIM_POS                  (0) /* No description available. */
#define CRG_TOP_POR_CTRL_POR_VSYS_SLEEP_CYCLE_EN           (1U << 11) /* Enables POR_VSYS during BOD check cycles in sleep (If POR_VSYS_DISABLE = 0) */
#define CRG_TOP_POR_CTRL_POR_VSYS_HYST_SEL                 (1U << 10) /* "Selects POR_VSYS threshold level, when hysteresis is disabled (see POR_VSYS_DIS */
#define CRG_TOP_POR_CTRL_POR_VSYS_HYST_DISABLE             (1U << 9) /* Disable POR_VSYS hysteresis. */
#define CRG_TOP_POR_CTRL_POR_VSYS_FORCE_ON                 (1U << 8) /* FORCE POR_VSYS to be ON (also in SLEEP) */
#define CRG_TOP_POR_CTRL_POR_VSYS_MASK                     (1U << 7) /* Mask POR on VSYS */
#define CRG_TOP_POR_CTRL_POR_VSYS_DISABLE                  (1U << 6) /* Disable POR_VSYS */
#define CRG_TOP_POR_CTRL_POR_V30_SLEEP_CYCLE_EN            (1U << 5) /* Enables POR_V30 during BOD check cycles in sleep (If POR_V30_DISABLE = 0) */
#define CRG_TOP_POR_CTRL_POR_V30_HYST_SEL                  (1U << 4) /* Selects POR_VDDA_3V0 threshold level, when hysteresis is disabled (see POR_VDDA_ */
#define CRG_TOP_POR_CTRL_POR_V30_HYST_DISABLE              (1U << 3) /* Disable POR_VDDA_3V0 hysteresis; select level with POR_VDDA_3V0_HYST_SEL */
#define CRG_TOP_POR_CTRL_POR_V30_FORCE_ON                  (1U << 2) /* Force POR_VDDA_3V0 always ON, (also in SLEEP) */
#define CRG_TOP_POR_CTRL_POR_V30_MASK                      (1U << 1) /* Mask POR_VDDA_3V0 */
#define CRG_TOP_POR_CTRL_POR_V30_DISABLE                   (1U << 0) /* Disable POR_VDDA_3V0 */
#define CRG_TOP_POR_PIN_POR_PIN_POLARITY                   (1U << 7) /* 0: Active Low 1: Active High Note: This applies only for the GPIO pin. Reset pad */
#define CRG_TOP_POR_PIN_POR_PIN_SELECT_MASK                (0x7F << 0) /* 0x00: P0_00 ... 0x1f: P0_31 0x20: P1_00 ... 0x3F: P1_31 0x40: P2_00 ... 0x4E: P2 */
#define CRG_TOP_POR_PIN_POR_PIN_SELECT_POS                 (0) /* 0x00: P0_00 ... 0x1f: P0_31 0x20: P1_00 ... 0x3F: P1_31 0x40: P2_00 ... 0x4E: P2 */
#define CRG_TOP_POR_TIMER_POR_TIME_MASK                    (0x7F << 0) /* Time for the POReset to happen. Formula: Time = POR_TIME x 4096 x RC32 clock per */
#define CRG_TOP_POR_TIMER_POR_TIME_POS                     (0) /* Time for the POReset to happen. Formula: Time = POR_TIME x 4096 x RC32 clock per */
#define CRG_TOP_POWER_CTRL_SW_V18F_SLEEP_ON                (1U << 19) /* Closes the V18F switch in sleep when DCDC_V18P_SLEEP_EN is 1. See SW_V18F regist */
#define CRG_TOP_POWER_CTRL_SW_V18F_ON                      (1U << 18) /* Closes the V18F switch when DCDC_V18P_EN is 1. See SW_V18F register for more set */
#define CRG_TOP_POWER_CTRL_DCDC_VLED_SLEEP_EN              (1U << 17) /* Enables boost dcdc led rail in sleep mode */
#define CRG_TOP_POWER_CTRL_DCDC_VLED_EN                    (1U << 16) /* Enables boost dcdc led rail in active mode */
#define CRG_TOP_POWER_CTRL_DCDC_V18P_SLEEP_EN              (1U << 15) /* Enables buck dcdc V18p rail in sleep mode */
#define CRG_TOP_POWER_CTRL_DCDC_V18P_EN                    (1U << 14) /* Enables buck dcdc V18p rail in active mode */
#define CRG_TOP_POWER_CTRL_DCDC_V18_SLEEP_EN               (1U << 13) /* Enables buck dcdc V18 rail in sleep mode */
#define CRG_TOP_POWER_CTRL_DCDC_V18_EN                     (1U << 12) /* Enables buck dcdc V18 rail in active mode */
#define CRG_TOP_POWER_CTRL_DCDC_V14_SLEEP_EN               (1U << 11) /* Enables buck dcdc V14 rail in sleep mode */
#define CRG_TOP_POWER_CTRL_DCDC_V14_EN                     (1U << 10) /* Enables buck dcdc V14 rail in active mode */
#define CRG_TOP_POWER_CTRL_DCDC_V12_SLEEP_EN               (1U << 9) /* Enables buck dcdc V12 rail in sleep mode */
#define CRG_TOP_POWER_CTRL_DCDC_V12_EN                     (1U << 8) /* Enables buck dcdc V12 rail in active mode */
#define CRG_TOP_POWER_CTRL_CLAMP_V12_DIS                   (1U << 7) /* Disables V12 clamp. During Hibernation, V12 clamp will be enabled regardless of  */
#define CRG_TOP_POWER_CTRL_CLAMP_V30_EN                    (1U << 6) /* Enables V30 clamp. */
#define CRG_TOP_POWER_CTRL_LDO_MIPI_EN                     (1U << 5) /* Enables ldo MIPI when DCDC_V18P_EN is 1 */
#define CRG_TOP_POWER_CTRL_LDO_RET_V30_SLEEP_EN            (1U << 4) /* Enables ldo V30 ret in sleep mode */
#define CRG_TOP_POWER_CTRL_LDO_RET_V30_EN                  (1U << 3) /* Enables ldo V30 ret in active mode */
#define CRG_TOP_POWER_CTRL_LDO_V30_SLEEP_EN                (1U << 2) /* Enables ldo V30 in sleep mode */
#define CRG_TOP_POWER_CTRL_LDO_V30_EN                      (1U << 1) /* Enables ldo V30 in active mode */
#define CRG_TOP_POWER_CTRL_LDO_START_EN                    (1U << 0) /* Enables ldo start. */
#define CRG_TOP_POWER_LVL_VSYS_LEVEL_MASK                  (0x3 << 17) /* Level setting for VSYS rail when ldo_vsys is enabled (COMP_VBUS_OK & COMP_VBUS_A */
#define CRG_TOP_POWER_LVL_VSYS_LEVEL_POS                   (17) /* Level setting for VSYS rail when ldo_vsys is enabled (COMP_VBUS_OK & COMP_VBUS_A */
#define CRG_TOP_POWER_LVL_V18_LEVEL                        (1U << 16) /* Level setting for V18 rail: 0=1.8V 1=1.2V */
#define CRG_TOP_POWER_LVL_V14_LEVEL_MASK                   (0x3 << 14) /* Level setting for V14 rail: 0=1.2V 1=1.3V 2=1.4V 3=1.5V */
#define CRG_TOP_POWER_LVL_V14_LEVEL_POS                    (14) /* Level setting for V14 rail: 0=1.2V 1=1.3V 2=1.4V 3=1.5V */
#define CRG_TOP_POWER_LVL_V12_SLEEP_LEVEL_MASK             (0x3 << 12) /* Level setting for V12 rail in sleep: 0=0.75V 1=0.9V 2=1.2V 3=reserved */
#define CRG_TOP_POWER_LVL_V12_SLEEP_LEVEL_POS              (12) /* Level setting for V12 rail in sleep: 0=0.75V 1=0.9V 2=1.2V 3=reserved */
#define CRG_TOP_POWER_LVL_V12_LEVEL_MASK                   (0x3 << 10) /* Level setting for V12 rail: 0=0.75V 1=0.9V 2=1.2V 3=reserved */
#define CRG_TOP_POWER_LVL_V12_LEVEL_POS                    (10) /* Level setting for V12 rail: 0=0.75V 1=0.9V 2=1.2V 3=reserved */
#define CRG_TOP_POWER_LVL_V30_SLEEP_LEVEL_MASK             (0x3 << 8) /* Level setting for V30 in sleep: 0x0: 3.0V 0x1: reserved 0x2: 3.3V 0x3: 3.3V */
#define CRG_TOP_POWER_LVL_V30_SLEEP_LEVEL_POS              (8) /* Level setting for V30 in sleep: 0x0: 3.0V 0x1: reserved 0x2: 3.3V 0x3: 3.3V */
#define CRG_TOP_POWER_LVL_V30_LEVEL_MASK                   (0x3 << 6) /* Level setting for V30: 0x0: 3.0V 0x1: reserved 0x2: 3.3V 0x3: 3.3V */
#define CRG_TOP_POWER_LVL_V30_LEVEL_POS                    (6) /* Level setting for V30: 0x0: 3.0V 0x1: reserved 0x2: 3.3V 0x3: 3.3V */
#define CRG_TOP_POWER_LVL_VMIPI_LEVEL_MASK                 (0x7 << 3) /* LDO MIPI level: 0.9V+0.05V*LDO_MIPI_LEVEL. Default=1.2V */
#define CRG_TOP_POWER_LVL_VMIPI_LEVEL_POS                  (3) /* LDO MIPI level: 0.9V+0.05V*LDO_MIPI_LEVEL. Default=1.2V */
#define CRG_TOP_POWER_LVL_CLAMP_V12_LEVEL_MASK             (0x7 << 0) /* Level setting for V12 clamp, retained in hibernation (only V12 source in Hiberna */
#define CRG_TOP_POWER_LVL_CLAMP_V12_LEVEL_POS              (0) /* Level setting for V12 clamp, retained in hibernation (only V12 source in Hiberna */
#define CRG_TOP_RAM_PWR_CTRL_RAM13_PWR_CTRL_MASK           (0x3 << 26) /* See description of RAM0_PWR_CTRL. */
#define CRG_TOP_RAM_PWR_CTRL_RAM13_PWR_CTRL_POS            (26) /* See description of RAM0_PWR_CTRL. */
#define CRG_TOP_RAM_PWR_CTRL_RAM12_PWR_CTRL_MASK           (0x3 << 24) /* See description of RAM0_PWR_CTRL. */
#define CRG_TOP_RAM_PWR_CTRL_RAM12_PWR_CTRL_POS            (24) /* See description of RAM0_PWR_CTRL. */
#define CRG_TOP_RAM_PWR_CTRL_RAM11_PWR_CTRL_MASK           (0x3 << 22) /* See description of RAM0_PWR_CTRL. */
#define CRG_TOP_RAM_PWR_CTRL_RAM11_PWR_CTRL_POS            (22) /* See description of RAM0_PWR_CTRL. */
#define CRG_TOP_RAM_PWR_CTRL_RAM10_PWR_CTRL_MASK           (0x3 << 20) /* See description of RAM0_PWR_CTRL. */
#define CRG_TOP_RAM_PWR_CTRL_RAM10_PWR_CTRL_POS            (20) /* See description of RAM0_PWR_CTRL. */
#define CRG_TOP_RAM_PWR_CTRL_RAM9_PWR_CTRL_MASK            (0x3 << 18) /* See description of RAM0_PWR_CTRL. */
#define CRG_TOP_RAM_PWR_CTRL_RAM9_PWR_CTRL_POS             (18) /* See description of RAM0_PWR_CTRL. */
#define CRG_TOP_RAM_PWR_CTRL_RAM8_PWR_CTRL_MASK            (0x3 << 16) /* See description of RAM0_PWR_CTRL. */
#define CRG_TOP_RAM_PWR_CTRL_RAM8_PWR_CTRL_POS             (16) /* See description of RAM0_PWR_CTRL. */
#define CRG_TOP_RAM_PWR_CTRL_RAM7_PWR_CTRL_MASK            (0x3 << 14) /* See description of RAM0_PWR_CTRL. */
#define CRG_TOP_RAM_PWR_CTRL_RAM7_PWR_CTRL_POS             (14) /* See description of RAM0_PWR_CTRL. */
#define CRG_TOP_RAM_PWR_CTRL_RAM6_PWR_CTRL_MASK            (0x3 << 12) /* See description of RAM0_PWR_CTRL. */
#define CRG_TOP_RAM_PWR_CTRL_RAM6_PWR_CTRL_POS             (12) /* See description of RAM0_PWR_CTRL. */
#define CRG_TOP_RAM_PWR_CTRL_RAM5_PWR_CTRL_MASK            (0x3 << 10) /* See description of RAM0_PWR_CTRL. */
#define CRG_TOP_RAM_PWR_CTRL_RAM5_PWR_CTRL_POS             (10) /* See description of RAM0_PWR_CTRL. */
#define CRG_TOP_RAM_PWR_CTRL_RAM4_PWR_CTRL_MASK            (0x3 << 8) /* See description of RAM0_PWR_CTRL. */
#define CRG_TOP_RAM_PWR_CTRL_RAM4_PWR_CTRL_POS             (8) /* See description of RAM0_PWR_CTRL. */
#define CRG_TOP_RAM_PWR_CTRL_RAM3_PWR_CTRL_MASK            (0x3 << 6) /* See description of RAM0_PWR_CTRL. */
#define CRG_TOP_RAM_PWR_CTRL_RAM3_PWR_CTRL_POS             (6) /* See description of RAM0_PWR_CTRL. */
#define CRG_TOP_RAM_PWR_CTRL_RAM2_PWR_CTRL_MASK            (0x3 << 4) /* See description of RAM0_PWR_CTRL. */
#define CRG_TOP_RAM_PWR_CTRL_RAM2_PWR_CTRL_POS             (4) /* See description of RAM0_PWR_CTRL. */
#define CRG_TOP_RAM_PWR_CTRL_RAM1_PWR_CTRL_MASK            (0x3 << 2) /* See description of RAM0_PWR_CTRL. */
#define CRG_TOP_RAM_PWR_CTRL_RAM1_PWR_CTRL_POS             (2) /* See description of RAM0_PWR_CTRL. */
#define CRG_TOP_RAM_PWR_CTRL_RAM0_PWR_CTRL_MASK            (0x3 << 0) /* Power state control of the individual RAMs. May only change when the memory isn' */
#define CRG_TOP_RAM_PWR_CTRL_RAM0_PWR_CTRL_POS             (0) /* Power state control of the individual RAMs. May only change when the memory isn' */
#define CRG_TOP_RESET_STAT_SNC_WDOGRESET_STAT              (1U << 6) /* Indicates that a SNC-Watchdog timeout has happened. Note that it is also set whe */
#define CRG_TOP_RESET_STAT_CMAC_WDOGRESET_STAT             (1U << 5) /* Indicates that a CMAC-Watchdog timeout has happened. Note that it is also set wh */
#define CRG_TOP_RESET_STAT_SWD_HWRESET_STAT                (1U << 4) /* Indicates that a write to SWD_RESET_REG has happened. Note that it is also set w */
#define CRG_TOP_RESET_STAT_WDOGRESET_STAT                  (1U << 3) /* Indicates that a Watchdog timeout has happened. Note that it is also set when a  */
#define CRG_TOP_RESET_STAT_SWRESET_STAT                    (1U << 2) /* Indicates that a SW Reset has happened */
#define CRG_TOP_RESET_STAT_HWRESET_STAT                    (1U << 1) /* Indicates that a HW Reset has happened */
#define CRG_TOP_RESET_STAT_PORESET_STAT                    (1U << 0) /* Indicates that a PowerOn Reset has happened. All bitfields of RESET_STAT_REG sho */
#define CRG_TOP_RST_CTRL_SYS_CACHE_FLUSH_WITH_SW_RESET     (1U << 0) /* 0: Flush the System Cache memory only at HW reset. 1: Flush the System Cache mem */
#define CRG_TOP_SECURE_BOOT_PROT_OTP_CS_WRITE              (1U << 9) /* This bit will permanentlly disable any write action to the CS inside the OTP */
#define CRG_TOP_SECURE_BOOT_FORCE_SNC_DEBUGGER_OFF         (1U << 8) /* This bit will permanently disable the SNC debugger */
#define CRG_TOP_SECURE_BOOT_PROT_OQSPIF_KEY_READ           (1U << 7) /* This bit will permanently disable CPU read capability at OTP offset 0x00000B00 a */
#define CRG_TOP_SECURE_BOOT_PROT_OQSPIF_KEY_WRITE          (1U << 6) /* This bit will permanently disable ANY write capability at OTP offset 0x00000B00  */
#define CRG_TOP_SECURE_BOOT_PROT_AES_KEY_READ              (1U << 5) /* This bit will permanently disable CPU read capability at OTP offset 0x00000A00 a */
#define CRG_TOP_SECURE_BOOT_PROT_AES_KEY_WRITE             (1U << 4) /* This bit will permanently disable ANY write capability at OTP offset 0x00000A00  */
#define CRG_TOP_SECURE_BOOT_PROT_SIG_KEY_WRITE             (1U << 3) /* This bit will permanently disable ANY write capability at OTP offset 0x000008C0  */
#define CRG_TOP_SECURE_BOOT_FORCE_CMAC_DEBUGGER_OFF        (1U << 2) /* This bit will permanently disable the CMAC debugger */
#define CRG_TOP_SECURE_BOOT_FORCE_DEBUGGER_OFF             (1U << 1) /* Follows the respective OTP flag value. Its value is updated by the BootROM code. */
#define CRG_TOP_SECURE_BOOT_SECURE_BOOT                    (1U << 0) /* Follows the respective OTP flag value. Its value is updated by the BootROM code. */
#define CRG_TOP_SLP_MAP_LCD_INV_EXT_CLK_SLP_MAP            (1U << 8) /* Maps inverted LCD_EXT_CLK on P0_10, for LCD XFRP function This state is preserve */
#define CRG_TOP_SLP_MAP_LCD_EXT_CLK_SLP_MAP                (1U << 7) /* Maps LCD_EXT_CLK on P0_19, for LCD VCOM/FRP/EXTCOMIN function This state is pres */
#define CRG_TOP_SLP_MAP_BANDGAP_SLP_MAP                    (1U << 6) /* Setting this bit will:  -map bandgap_enable to P0_13 -map (wokenup OR cmac_slp_t */
#define CRG_TOP_SLP_MAP_RCLP_SLP_MAP                       (1U << 5) /* Maps RCLP onto P1_23. This state is preserved during deep sleep, to allow pin ou */
#define CRG_TOP_SLP_MAP_XTAL32K_SLP_MAP                    (1U << 4) /* Maps XTA32k onto P0_31. This state is preserved during deep sleep, to allow pin  */
#define CRG_TOP_SLP_MAP_RCX_SLP_MAP                        (1U << 3) /* Maps RCX onto P1_22. This state is preserved during deep sleep, to allow pin out */
#define CRG_TOP_SLP_MAP_TMR4_PWM_SLP_MAP                   (1U << 2) /* Maps Timer4_pwm onto P1_31 This state is preserved during deep sleep, to allow p */
#define CRG_TOP_SLP_MAP_TMR3_PWM_SLP_MAP                   (1U << 1) /* Maps Timer3_pwm onto P1_30 This state is preserved during deep sleep, to allow p */
#define CRG_TOP_SLP_MAP_TMR_PWM_SLP_MAP                    (1U << 0) /* Maps Timer1_pwm onto P0_30 This state is preserved during deep sleep, to allow p */
#define CRG_TOP_SW_V18F_DELAY_TRIM_MASK                    (0x3 << 2) /* Soft start delay trim */
#define CRG_TOP_SW_V18F_DELAY_TRIM_POS                     (2) /* Soft start delay trim */
#define CRG_TOP_SW_V18F_SKIP_SOFT_START                    (1U << 1) /* Skip soft start routine */
#define CRG_TOP_SW_V18F_FORCE_SW_ON                        (1U << 0) /* Forces closing sw_V18f, independent of v18p state */
#define CRG_TOP_SYS_CTRL_SW_RESET                          (1U << 15) /* Writing a '1' to this bit will generate a SW_RESET. */
#define CRG_TOP_SYS_CTRL_CACHERAM_MUX                      (1U << 10) /* Controls accessiblity of Cache RAM: 0: the cache controller is bypassed, the cac */
#define CRG_TOP_SYS_CTRL_TIMEOUT_DISABLE                   (1U << 9) /* Disables timeout in Power statemachine. By default, the statemachine continues i */
#define CRG_TOP_SYS_CTRL_DEBUGGER_ENABLE                   (1U << 7) /* Enable the debugger. This bit is set by the booter according to the OTP header.  */
#define CRG_TOP_SYS_CTRL_SNC_DEBUGGER_ENABLE               (1U << 5) /* Enable the CMAC debugger. If not set, the SWDIO and SW_CLK can be used as gpio p */
#define CRG_TOP_SYS_CTRL_REMAP_INTVECT                     (1U << 3) /* 0: normal operation 1: If ARM is in address range 0 to 0x1FF then the address is */
#define CRG_TOP_SYS_CTRL_REMAP_ADR0_MASK                   (0x7 << 0) /* Controls which memory is located at address 0x0000 for execution. 0x0: ROM 0x1:  */
#define CRG_TOP_SYS_CTRL_REMAP_ADR0_POS                    (0) /* Controls which memory is located at address 0x0000 for execution. 0x0: ROM 0x1:  */
#define CRG_TOP_SYS_STAT_GPU_IS_UP                         (1U << 17) /* Indicates that PD_GPU is functional */
#define CRG_TOP_SYS_STAT_GPU_IS_DOWN                       (1U << 16) /* Indicates that PD_GPU is in power down */
#define CRG_TOP_SYS_STAT_CTRL_IS_UP                        (1U << 15) /* Indicates that PD_CTRL is functional */
#define CRG_TOP_SYS_STAT_CTRL_IS_DOWN                      (1U << 14) /* Indicates that PD_CTRL is in power down */
#define CRG_TOP_SYS_STAT_POWER_IS_UP                       (1U << 13) /* Indicates that the Startup statemachine is finished, and all power regulation is */
#define CRG_TOP_SYS_STAT_DBG_IS_ACTIVE                     (1U << 12) /* Indicates that a debugger is attached. */
#define CRG_TOP_SYS_STAT_SNC_IS_UP                         (1U << 11) /* Indicates that PD_SNC is functional */
#define CRG_TOP_SYS_STAT_SNC_IS_DOWN                       (1U << 10) /* Indicates that PD_SNC is in power down */
#define CRG_TOP_SYS_STAT_TIM_IS_UP                         (1U << 9) /* Indicates that PD_TIM is functional */
#define CRG_TOP_SYS_STAT_TIM_IS_DOWN                       (1U << 8) /* Indicates that PD_TIM is in power down */
#define CRG_TOP_SYS_STAT_MEM_IS_UP                         (1U << 7) /* Indicates that PD_MEM is functional */
#define CRG_TOP_SYS_STAT_MEM_IS_DOWN                       (1U << 6) /* Indicates that PD_MEM is in power down */
#define CRG_TOP_SYS_STAT_SYS_IS_UP                         (1U << 5) /* Indicates that PD_SYS is functional */
#define CRG_TOP_SYS_STAT_SYS_IS_DOWN                       (1U << 4) /* Indicates that PD_SYS is in power down */
#define CRG_TOP_SYS_STAT_AUD_IS_UP                         (1U << 3) /* Indicates that PD_AUD is functional */
#define CRG_TOP_SYS_STAT_AUD_IS_DOWN                       (1U << 2) /* Indicates that PD_AUD is in power down */
#define CRG_TOP_SYS_STAT_RAD_IS_UP                         (1U << 1) /* Indicates that PD_RAD is functional */
#define CRG_TOP_SYS_STAT_RAD_IS_DOWN                       (1U << 0) /* Indicates that PD_RAD is in power down */
#define CRG_TOP_VBUS_IRQ_CLEAR_VBUS_IRQ_CLEAR_MASK         (0xFFFF << 0) /* Writing any value to this register will reset the VBUS_IRQ line */
#define CRG_TOP_VBUS_IRQ_CLEAR_VBUS_IRQ_CLEAR_POS          (0) /* Writing any value to this register will reset the VBUS_IRQ line */
#define CRG_TOP_VBUS_IRQ_MASK_VBUS_WAKEUP_CLKLESS          (1U << 2) /* Enables waking up from CLKLESS mode when VBUS becomes available. For the system  */
#define CRG_TOP_VBUS_IRQ_MASK_VBUS_IRQ_EN_RISE             (1U << 1) /* Setting this bit to '1' enables VBUS_IRQ generation when the VBUS starts to ramp */
#define CRG_TOP_VBUS_IRQ_MASK_VBUS_IRQ_EN_FALL             (1U << 0) /* Setting this bit to '1' enables VBUS_IRQ generation when the VBUS starts to fall */
#define CRG_TOP_WAKEUP_HIBERN_HIBERNATION_ENABLE           (1U << 12) /* Enable hibernation mode */
#define CRG_TOP_WAKEUP_HIBERN_WAKEUP_PD_EN_MASK            (0xF << 6) /* Enables pulldown for GPIO[n] during hibernation Bit 0: P0_20 Bit 1: P0_29 Bit 2: */
#define CRG_TOP_WAKEUP_HIBERN_WAKEUP_PD_EN_POS             (6) /* Enables pulldown for GPIO[n] during hibernation Bit 0: P0_20 Bit 1: P0_29 Bit 2: */
#define CRG_TOP_WAKEUP_HIBERN_WAKEUP_EN_MASK               (0xF << 0) /* Enables GPIO[n] to wake up from hibernation Bit 0: P0_20 Bit 1: P0_29 Bit 2: P1_ */
#define CRG_TOP_WAKEUP_HIBERN_WAKEUP_EN_POS                (0) /* Enables GPIO[n] to wake up from hibernation Bit 0: P0_20 Bit 1: P0_29 Bit 2: P1_ */

#endif /* __DA1470_CRG_TOP_H */
